## GroupBy

It allows you to group the rows together and call aggregate functions

In [1]:
import pandas as pd

# Create DF
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB','ORCL','ORCL'],
       'Person':['Santosh','Vivek','Akshay','Rohit','B.mat','Ashish','Rsgupta','Sugathi'],
       'Sales':[200,120,542,123,456,7654,354,4543]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  Company   Person  Sales
0    GOOG  Santosh    200
1    GOOG    Vivek    120
2    MSFT   Akshay    542
3    MSFT    Rohit    123
4      FB    B.mat    456
5      FB   Ashish   7654
6    ORCL  Rsgupta    354
7    ORCL  Sugathi   4543

In [5]:
df.groupby('Company')

In [6]:
grp = df.groupby('Company')

In [7]:
grp.mean()

          Sales
Company
FB       4055.0
GOOG      160.0
MSFT      332.5
ORCL     2448.5

In [8]:
grp.std()

               Sales
Company
FB       5089.754611
GOOG       56.568542
MSFT      296.277741
ORCL     2962.070306

In [9]:
grp.min()

          Person  Sales
Company
FB        Ashish    456
GOOG     Santosh    120
MSFT      Akshay    123
ORCL     Rsgupta    354

In [10]:
grp.max()

          Person  Sales
Company
FB         B.mat   7654
GOOG       Vivek    200
MSFT       Rohit    542
ORCL     Sugathi   4543

In [11]:
grp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2
ORCL          2      2

In [12]:
grp.describe()

        Sales
        count    mean          std    min      25%     50%      75%     max
Company
FB        2.0  4055.0  5089.754611  456.0  2255.50  4055.0  5854.50  7654.0
GOOG      2.0   160.0    56.568542  120.0   140.00   160.0   180.00   200.0
MSFT      2.0   332.5   296.277741  123.0   227.75   332.5   437.25   542.0
ORCL      2.0  2448.5  2962.070306  354.0  1401.25  2448.5  3495.75  4543.0

In [14]:
grp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# Great Job !!!